
namespace HIS.Base_BLL
{
    /// <summary>
    /// 基础数据类型枚举
    /// </summary>
    public enum DataEnum
    {
        医院列表,
        模块列表,
        菜单列表,
        用户组列表,
        用户组菜单表,
        用户信息表,
        用户及用户组关系表,
        科室类型表,
        医院科室表,
        医院人员信息表,
        医院人员科室信息表,
        医生类型表,
        医生列表,
        国标名称分类表,
        国标项目表,
        基本统计分类表,
        门诊发票项目表,
        住院发票项目表,
        门诊会计项目表,
        住院会计项目表,
        门诊医保项目表,
        住院医保项目表,
        医院核算项目表,
        医院病案项目表,
        医保药品类型表,

        基本医疗服务项目表 ,
        基本药品列表,
        组合项目表 ,
        组合项目明细表 ,
        划价模板表 ,
        划价模板明细表 ,

        院内药品应用表 ,
        院内基本医疗服务项目表,
        院内组合项目表,

        医嘱项目表,
        医嘱类型表,
        用法定义表,
        用法费用联动表,
        频次定义表,
        医技分类表,
        药剂科室表,
        医生处方修改权限表,
        门诊经管参数表,
        住院经管参数表,
        门诊医生参数表,
        住院医生参数表,
        住院护士参数表,
        药品参数表,
        挂号类别表,
        挂号类别与服务项目对应表
    }
}
